<script>
import $api from "@/http";

export default {
  data() {
    return {};
  },
  methods: {},
  mounted() {
  },
};
</script>

<template>
  <main>
    <div class="scroll-content">
      <div class="page_fit_content">
        <div class="routing_router">
          <div class="routing_router_box">
            <ul class="routing_router_content">
              <li class="routing_router_items">
                <a aria-label="site native link" class="cursor-pointer" @click="this.$router.push({path: '/'})">
                      <span class="routing_router_body" content="/">
                        <span content="Главная" itemprop="name">Главная</span>
                      </span>
                </a>
                <meta content="1" itemprop="position">
              </li>
              <li class="routing_router_items">
                <a aria-label="site native link" class="cursor-pointer"
                   @click="this.$router.push({path: '/customer_service'})">
                      <span class="routing_router_body" content="/customer_service">
                        <span content="Избранное" itemprop="name">Обслуживание клиентов</span>
                      </span>
                </a>
                <meta content="2" itemprop="position">
              </li>
              <li class="routing_router_items">
                <a aria-label="site native link" class="cursor-pointer"
                   @click="this.$router.push({path: '/customer_service/user_agreement'})">
                      <span class="routing_router_body" content="/customer_service/user_agreement">
                        <span content="Избранное" itemprop="name">Пользовательское соглашение</span>
                      </span>
                </a>
                <meta content="3" itemprop="position">
              </li>
            </ul>
          </div>
        </div>
        <div class="container-box">
          <div class="customer_services_customer_service_page">
            <div class="customer_services_customer_service_page_title">
              Пользовательское соглашение
            </div>
          </div>
          <div class="customer_services_page_content">
            <div class="customer-service-content">
              <p style="text-align: center">Пользовательское соглашение об использовании сайта <a
                  style="text-decoration: underline; cursor: pointer"
                  @click="this.$router.push({path: '/'})">wannatrend.ru</a>
              </p>
              <p style="font-weight: bold"><br>1. Термины и определения</p>
              <p><br><b>Пользовательское соглашение</b> (далее по тексту – Соглашение) – публичное
                предложение Сайта, адресованное неопределенному кругу лиц, заключить
                с Сайтом/Продавцом договор купли-продажи товара дистанционным способом.
              </p>
              <p><br><b>Сайт <a style="text-decoration: underline; cursor: pointer"
                                @click="this.$router.push({path: '/'})">wannatrend.ru</a></b> – это веб-сайт
                (далее по тексту
                –
                Сайт), который
                предоставляет доступ к информации о товарах, предназначенных для потенциальных
                покупателей. Сайт выступает как агент между Продавцом и Покупателем.
              </p>
              <p><br><b>Покупатель</b> - физическое лицо, имеющее намерение заказать и приобрести товары,
                размещенные на Сайте.
              </p>
              <p><br><b>Продавец</b> - индивидуальный предприниматель, юридическое лицо или самозанятый
                гражданин, осуществляющие деятельность по продаже товаров и предлагающие
                Покупателю, в том числе через Сайт (агента), приобрести Товар.
              </p>
              <p><br><b>Товар</b> - предмет договора купли-продажи, заключаемого между Покупателем и
                Сайтом или Продавцом.
              </p>
              <p><br><b>Заказ</b> - осуществление Покупателем действий, направленных на заключение им
                договоров купли-продажи товара, оказания услуг доставки с использованием
                функциональных возможностей Сайта.
              </p>
              <p><br><b>Карточка товара</b> - интерфейс Сайта в отношении определенной модели Товара,
                который содержит описание товара, стоимость и иные характеристики, которые
                позволяют оформить Заказ.
              </p>
              <p style="font-weight: bold"><br>2. Общее положение</p>
              <p><br>2.1. Заказывая Товары через Сайт, Покупатель соглашается с настоящими
                Соглашением, с условиями продажи, доставки, возврата/обмена Товаров,
                изложенными на сайте и в Соглашении.
              </p>
              <p><br>2.2. К отношениям между Покупателем и Сайтом/Продавцом применяются
                положения Закона «О защите прав потребителей» и иные правовые акты РФ,
                принятые в соответствии с ним.
              </p>
              <p><br>2.3. Сайт оставляет за собой право вносить изменения в настоящие Правила,
                в связи с чем Покупатель обязуется регулярно отслеживать изменения
                в Правилах, размещенных на Сайте.
              </p>
              <p><br>2.4. Покупатель обязуется не сообщать третьим лицам логин и пароль, указанные
                при регистрации. В случае возникновения у Покупателя подозрений
                относительно безопасности его логина и пароля или возможности
                их несанкционированного использования третьими лицами, Покупатель
                обязуется незамедлительно уведомить об этом Сайт и изменить
                регистрационные данные в разделе «Личный кабинет».
              </p>
              <p><br>2.5. В случае отсутствия заказанных Товаров на Сайте, в том числе по причинам,
                не зависящим от последнего, Сайт вправе аннулировать указанный Товар
                из Заказа Покупателя и уведомить об этом Покупателя путем направления
                электронного сообщения по адресу либо уведомить Покупателя посредством
                телефонного звонка, сообщения, указанного при регистрации.
              </p>
              <p><br>2.6. В случае аннулирования Заказа полностью или частично, стоимость
                (денежные средства) аннулированного Заказа при предоплате Покупателем
                Сайт/Продавец обязуется вернуть в течение 10 (десяти) рабочих дней
              </p>
              <p><br>2.7. Обмен/возврат товара надлежащего качества возможен в случае, если
                сохранены его товарный вид, потребительские свойства, а также документ,
                подтверждающий факт и условия покупки указанного товара. Отсутствие
                у потребителя документа, подтверждающего факт и условия покупки товара,
                не лишает его возможности ссылаться на другие доказательства приобретения
                товара у данного продавца.
              </p>
              <p><br>2.8. Обмен/возврат товара надлежащего качества, но не подошедшего по размеру,
                фасону, цвету и т.д. осуществляется за счет покупателя.
              </p>
              <p><br>2.9. Обмен/возврат товара не надлежащего качества осуществляется за счет Сайта/Продавца.</p>
              <p><br>2.10. Сайт не несет ответственность за задержки, сбои, неверную или
                несвоевременную доставку Курьерской службой.
              </p>
              <p><br>2.11. Покупатель гарантирует, что: указал корректный адрес доставки; указал
                корректный номер телефона для контактов; указал корректный адрес
                электронной почты для контактов; иная информация, указанная покупателем,
                является корректной и достоверной; своими силами и за свой счет
                обеспечивает безопасность данных, указанных при регистрации, оформлении
                заказа.
              </p>
              <p><br>2.12. Стороны признают, что Сайт/Продавец считается исполнившим свои
                обязательства по доставке Товара надлежащим образом, если использовал
                данные Покупателя, указанные в регистрационной форме.
              </p>
              <p><br>2.13. Претензии в электронной форме необходимо направлять на электронный
                адрес <a href="mailto:wannatrend@mail.ru" style="text-decoration: underline" target="_blank">wannatrend@mail.ru</a>
              </p>
              <p><br>2.14. Покупатель обязуется не использовать сервисы Сайта с целью нарушения
                законодательства РФ.
              </p>
              <p style="font-weight: bold"><br>3. Оформление заказа</p>
              <p><br>3.1. Заказ Товаров на Сайте.
                Размещение Заказа происходит путем нажатия в Карточке товара кнопки «Добавить
                в корзину». После оформления заказа, Покупателю отправляется sms/e-mail уведомление
                об оформлении заказа.
              </p>
              <p><br>3.2. Изменение и отмена Заказа.
                Если после получения Заказа Сайтом обнаруживается, что в наличии отсутствует
                необходимое количество заказанного Товара, Сайт информирует об этом Покупателя
                по телефону и/или электронным письмом. В этом случае Сайт вправе отменить заказ,
                если он не был оплачен Покупателем. В случае, если заказ был предварительно оплачен
                Покупателем, Сайт осуществляет возврат уплаченных Покупателем за товар денежных
                средств. Покупатель вправе согласиться принять Товар в количестве, имеющемся
                в наличии у Сайта/Продавца, либо аннулировать данную позицию Товара из Заказа.
              </p>
              <p style="font-weight: bold"><br>4. Стоимость и оплата</p>
              <p><br>4.1. Цена, взимаемая за Товар, является ценой на момент размещения
                Заказа/Резервирования и указывается на Сайте в описании Товара.
              </p>
              <p><br>4.2. Сайт вправе изменять цены на Товары в любое время без предварительного
                уведомления. По подтвержденным Заказам цена на товар изменению
                не подлежит.
              </p>
              <p><br>4.3. Оплата осуществляется при получении товара в пункте выдачи Курьерской
                службы.
              </p>
              <p><br>4.4. Подтверждением оплаты является либо кассовый чек, либо иной документ,
                применяемый на территории Российской Федерации в соответствии
                с действующим законодательством РФ, подтверждающий оплату Товара.
              </p>
              <p><br>4.5. Договор купли-продажи считается заключенным с момента оплаты
                Покупателем заказанных Товаров.
              </p>
              <p style="font-weight: bold"><br>5. Защита персональных данных</p>
              <p><br>5.1. При оформлении заказа на Сайте Покупатель предоставляет о себе
                следующую информацию: фамилия, имя, отчество, номер контактного
                телефона (мобильного и/или домашнего), адрес электронной почты, адрес
                доставки Заказа и иные необходимые данные (далее — персональные данные).
              </p>
              <p><br>5.2. Персональные данные Покупателя будут обрабатываться Сайтом способами
                включающими: сбор, запись, систематизацию, накопление, хранение,
                уточнение (обновление, изменение), извлечение, использование, передачу
                (предоставление, доступ), обезличивание, блокирование, удаление,
                уничтожение, в т. ч. с использованием средств автоматизации или без
                использования таких средств, в целях продажи Товаров и/или оказания услуг,
                изложенных в настоящих Правилах, включая, но не ограничиваясь
                информированием о Заказе, ведением претензионной работы, анализом
                качества предоставляемого Сайтом сервиса и улучшением качества
                обслуживания клиентов Сайта, оказанием услуг по доставке, реализацией
                возможности возврата Товара.
              </p>
              <p><br>5.3. Пользователь, действуя свободно, своей волей и в своем интересе,
                предоставляет свое согласие на обработку персональных данных Сайту.
              </p>
              <p><br>5.4. В целях исполнения своих обязательств перед Покупателем Сайт вправе
                передавать персональные данные Покупателей Продавцу.
              </p>
              <p><br>5.5. Сайт гарантирует, что осуществляет обработку и обеспечивает защиту
                персональных данных в соответствии с действующим законодательством
                Российской Федерации. Обработка персональных данных Покупателя
                осуществляется на территории Российской Федерации.
              </p>
            </div>
          </div>
        </div>
      </div>
    </div>
  </main>
</template>

<style scoped>
.scroll-content {
  margin-top: 71px;
}

.page_fit_content {
  min-height: 640px;
}

.container-box {
  width: 100%;
  max-width: 992px;
  margin: 0 auto !important;
  padding: 0;
}

.routing_router {
  width: 100%;
  height: 100%;
  position: relative;
}

.routing_router_box {
  display: flex;
  justify-content: center;
  align-items: center;
  flex-direction: row;
  margin: 15px 0;
}

.routing_router_content {
  flex-wrap: wrap;
  list-style: none;
  margin: 0;
  padding: 0 15px;
  display: flex;
  justify-content: flex-start;
  align-items: center;
  flex-direction: row;
}

.routing_router_items {
  position: relative;
}

.routing_router_body {
  font-size: 11px;
  font-weight: 400;
  text-transform: uppercase;
  transition: color .3s cubic-bezier(.42, .1, 1, 1);
  cursor: pointer;
}

.routing_router_items:after {
  content: "/";
  padding: 0 5px;
  font-size: 10px;
}

.routing_router_items:last-child:after {
  content: none; /* Удаляем символ "/" */
  padding-right: 0; /* Удаляем отступ справа */
}

.customer_services_page_content {
  font-size: 15px;
  padding: 0 40px;
  line-height: 22px;
}

.customer-service-content {
  margin-top: 30px;
  width: 100%;
  height: auto;
}

.customer_services_customer_service_page {
  width: 100%;
  height: auto;
  position: relative;
}

.customer_services_customer_service_page_title {
  display: block;
  width: 100%;
  height: auto;
  text-align: center;
  font-size: 34px;
  font-family: Bodoni Cyrillic, Futura PT, serif;
  font-weight: 300;
  text-transform: uppercase;
}

p {
  margin: 0;
}
</style>